# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes


backbone:
  - [-1, 1, Silence, []]                         # 0
  - [0, 1, FAM_OPT, []]                          # 1 OPT images
  - [0, 1, FAM_SAR, []]                          # 2 SAR images

# RGB and SAR backbone
  # GPT Fusion one
  - [1, 1, Conv, [32, 3, 2]]                     # 3-P1/2
  - [-1, 1, Conv, [64, 3, 2]]                   # 4-P2/4
  - [-1, 1, ELAN1, [64, 64, 32]]            # 5
  - [-1, 1, AConv, [128]]                   # 6-P3/8
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]]            # 7

  - [2, 1, Conv, [32, 3, 2]]                     # 8-P1/2
  - [-1, 1, Conv, [64, 3, 2]]                   # 9-P2/4
  - [-1, 1, ELAN1, [64, 64, 32]]            # 10
  - [-1, 1, AConv, [128]]                   # 11-P3/8
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]]            # 12

  - [[7, 12], 1, CMIM, [128, 16]]  # 13 [channel, sra, h, w, number]
  - [[7, 13], 1, Add_GPT, [128, 0]]              # 14-P2/4 stream one:x + trans[0]
  - [[12, 13], 1, Add_GPT, [128, 1]]             # 15-P2/4 stream two:x + trans[1]


  # GPT Fusion two
  - [14, 1, AConv, [192]]                   # 16-P4/16
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]]                   # 17

  - [15, 1, AConv, [192]]                   # 18-P4/16
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]]                   # 19

  - [[17, 19], 1, CMIM, [192, 16]] # 20
  - [[17, 20], 1, Add_GPT, [192, 0]]             # 21-P4/16 stream one:x + trans[0]
  - [[19, 20], 1, Add_GPT, [192, 1]]             # 22-P4/16 stream two:x + trans[1]


  # GPT Fusion three
  - [21, 1, AConv, [256]]                  # 23-P5/32
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]]                  # 24
  - [-1, 1, SPPELAN, [256, 128]]                     # 25

  - [22, 1, AConv, [256]]                  # 26-P5/32
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]]                  # 27
  - [-1, 1, SPPELAN, [256, 128]]                     # 28

  - [[25, 28], 1, CMIM, [256, 32]] # 29
  - [[25, 29], 1, Add_GPT, [256, 0]]            # 30-P5/32 stream one:x + trans[0]
  - [[28, 29], 1, Add_GPT, [256, 1]]            # 31-P5/32 stream two:x + trans[1]

  # Add Block 
  - [[14, 15], 1, AFM, [128]]                   # 32-P3/8  fusion backbone P3
  - [[21, 22], 1, AFM, [192]]                   # 33-P4/16 fusion backbone P4
  - [[30, 31], 1, AFM, [256]]                   # 34-P5/32 fusion backbone P5
  # - [-1, 1, PSA, [1024]]                       # 35


# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 35
  - [[-1, 33], 1, Concat, [1]]                   # 36 cat backbone P4
  - [-1,  1, RepNCSPELAN4, [192, 192, 96, 3]]                  # 37

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 38
  - [[-1, 32], 1, Concat, [1]]                   # 39 cat backbone P3
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]]                  # 40 (P3/8-small)

  - [-1, 1, AConv, [96]]                   # 41
  - [[-1, 37], 1, Concat, [1]]                   # 42 cat head P4
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]]                  # 43 (P4/16-medium)

  - [-1, 1, AConv, [128]]                   # 44
  - [[-1, 34], 1, Concat, [1]]                   # 45 cat head P5
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]]                  # 46 (P5/32-large)

  - [[40, 43, 46], 1, OBB, [nc, 1]]              # Detect (P3, P4, P5)

