# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 Oriented Bounding Boxes (OBB) model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/obb

# CSSA: Multimodal Object Detection by Channel Switching and Spatial Attention CVPR 2023

# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-obb.yaml' will call yolo11-obb.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # summary: 344 layers, 9744931 parameters, 9744915 gradients, 22.7 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]                         # 0
  - [0, 1, SilenceRGB, []]                       # 1 RGB images
  - [0, 1, SilenceRadar, []]                     # 2 SAR images

  # RGB backbone
  - [1, 1, Conv, [64, 3, 2]]                     # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 4-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]            # 5
  - [-1, 1, Conv, [256, 3, 2]]                   # 6-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]            # 7
  - [-1, 1, Conv, [512, 3, 2]]                   # 8-P4/16
  - [-1, 2, C3k2, [512, True]]                   # 9
  - [-1, 1, Conv, [1024, 3, 2]]                  # 10-P5/32
  - [-1, 2, C3k2, [1024, True]]                  # 11

  # SAR backbone
  - [2, 1, Conv, [64, 3, 2]]                     # 12-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 13-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]            # 14
  - [-1, 1, Conv, [256, 3, 2]]                   # 15-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]            # 16
  - [-1, 1, Conv, [512, 3, 2]]                   # 17-P4/16
  - [-1, 2, C3k2, [512, True]]                   # 18
  - [-1, 1, Conv, [1024, 3, 2]]                  # 19-P5/32
  - [-1, 2, C3k2, [1024, True]]                  # 20

  # CSSA fusion
  - [[7, 16], 1, CSSA, [256]]                    # 21 P3
  - [[9, 18], 1, CSSA, [512]]                    # 22 P4
  - [[11, 20], 1, CSSA, [1024]]                  # 23 P5
  - [-1, 1, SPPF, [1024, 5]]                     # 24
  - [-1, 2, C2PSA, [1024]]                       # 25

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 26
  - [[-1, 22], 1, Concat, [1]]                   # 27 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 28

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 29
  - [[-1, 21], 1, Concat, [1]]                   # 30 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                  # 31 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 32
  - [[-1, 28], 1, Concat, [1]]                   # 33 cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 34 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 35
  - [[-1, 25], 1, Concat, [1]]                   # 36 cat head P5
  - [-1, 2, C3k2, [1024, True]]                  # 37 (P5/32-large)

  - [[31, 34, 37], 1, OBB, [nc, 1]]              # Detect(P3, P4, P5)
