# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 Oriented Bounding Boxes (OBB) model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/obb

#CALNet: Multispectral Object Detection via Cross-Modal Conflict-Aware Learning  ACM Multimedia 2023

# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-obb.yaml' will call yolo11-obb.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # summary: 344 layers, 9744931 parameters, 9744915 gradients, 22.7 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]                         # 0
  - [0, 1, SilenceRGB, []]                       # 1 RGB images
  - [0, 1, SilenceRadar, []]                     # 2 SAR images

  # RGB and SAR backbone
  # GPT Fusion one
  - [1, 1, Conv, [64, 3, 2]]                     # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 4-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]            # 5
  - [-1, 1, Conv, [256, 3, 2]]                   # 6-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]            # 7

  - [2, 1, Conv, [64, 3, 2]]                     # 8-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 9-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]            # 10
  - [-1, 1, Conv, [256, 3, 2]]                   # 11-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]            # 12

  - [[7, 12], 1, GPTcross, [256, 3, 40, 40, 3]]  # 13 [channel, sra, h, w, number]
  - [[7, 13], 1, Add_GPT, [256, 0]]              # 14-P2/4 stream one:x + trans[0]
  - [[12, 13], 1, Add_GPT, [256, 1]]             # 15-P2/4 stream two:x + trans[1]


  # GPT Fusion two
  - [14, 1, Conv, [512, 3, 2]]                   # 16-P4/16
  - [-1, 2, C3k2, [512, True]]                   # 17

  - [15, 1, Conv, [512, 3, 2]]                   # 18-P4/16
  - [-1, 2, C3k2, [512, True]]                   # 19

  - [[17, 19], 1, GPTcross, [256, 2, 20, 20, 6]] # 20
  - [[17, 20], 1, Add_GPT, [512, 0]]             # 21-P4/16 stream one:x + trans[0]
  - [[19, 20], 1, Add_GPT, [512, 1]]             # 22-P4/16 stream two:x + trans[1]


  # GPT Fusion three
  - [21, 1, Conv, [1024, 3, 2]]                  # 23-P5/32
  - [-1, 2, C3k2, [1024, True]]                  # 24
  - [-1, 1, SPPF, [1024, 5]]                     # 25

  - [22, 1, Conv, [1024, 3, 2]]                  # 26-P5/32
  - [-1, 2, C3k2, [1024, True]]                  # 27
  - [-1, 1, SPPF, [1024, 5]]                     # 28

  - [[25, 28], 1, GPTcross, [512, 1, 10, 10, 3]] # 29
  - [[25, 29], 1, Add_GPT, [1024, 0]]            # 30-P5/32 stream one:x + trans[0]
  - [[28, 29], 1, Add_GPT, [1024, 1]]            # 31-P5/32 stream two:x + trans[1]

  # Add Block 
  - [[14, 15], 1, Conadd, [1]]                   # 32-P3/8  fusion backbone P3
  - [[21, 22], 1, Conadd, [1]]                   # 33-P4/16 fusion backbone P4
  - [[30, 31], 1, Conadd, [1]]                   # 34-P5/32 fusion backbone P5
  - [-1, 2, C2PSA, [1024]]                       # 35


# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 36
  - [[-1, 33], 1, Concat, [1]]                   # 37 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 38

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 39
  - [[-1, 32], 1, Concat, [1]]                   # 40 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                  # 41 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 42
  - [[-1, 38], 1, Concat, [1]]                   # 43 cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 44 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 45
  - [[-1, 35], 1, Concat, [1]]                   # 46 cat head P5
  - [-1, 2, C3k2, [1024, True]]                  # 47 (P5/32-large)

  - [[41, 44, 47], 1, OBB, [nc, 1]]              # Detect (P3, P4, P5)
