# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 Oriented Bounding Boxes (OBB) model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/obb

#MMI-Det: Exploring Multi-Modal Integration for Visible and Infrared Object Detection   TCSVT 2024


# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-obb.yaml' will call yolo11-obb.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # summary: 344 layers, 9744931 parameters, 9744915 gradients, 22.7 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]                         # 0
  - [0, 1, SilenceRGB, []]                       # 1 RGB images
  - [0, 1, SilenceRadar, []]                     # 2 SAR images

  # RGB and SAR backbone
  # GPT Fusion one
  - [1, 1, Conv, [64, 3, 2]]                     # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 4-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]            # 5

  - [2, 1, Conv, [64, 3, 2]]                     # 6-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 7-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]            # 8

  - [[5, 8], 1, MMI_fourier, [128]]              # 9
  - [[5, 9], 1, Add_GPT, [128, 0]]               # 10-P2/4 stream one:x + trans[0]
  - [[8, 9], 1, Add_GPT, [128, 1]]               # 11-P2/4 stream two:x + trans[1]


  # GPT Fusion two
  - [10, 1, Conv, [256, 3, 2]]                   # 12-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]            # 13

  - [11, 1, Conv, [256, 3, 2]]                   # 14-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]            # 15

  - [[13, 15], 1, GPT, [256]]                    # 16
  - [[13, 16], 1, Add_GPT, [256, 0]]             # 17-P3/8 stream one:x + trans[0]
  - [[15, 16], 1, Add_GPT, [256, 1]]             # 18-P3/8 stream two:x + trans[1]


  # GPT Fusion three
  - [17, 1, Conv, [512, 3, 2]]                   # 19-P4/16
  - [-1, 2, C3k2, [512, True]]                   # 20

  - [18, 1, Conv, [512, 3, 2]]                   # 21-P4/16
  - [-1, 2, C3k2, [512, True]]                   # 22

  - [[20, 22], 1, GPT, [256]]                    # 23
  - [[20, 23], 1, Add_GPT, [512, 0]]             # 24-P4/16 stream one:x + trans[0]
  - [[22, 23], 1, Add_GPT, [512, 1]]             # 25-P4/16 stream two:x + trans[1]


  # GPT Fusion four
  - [24, 1, Conv, [1024, 3, 2]]                  # 26-P5/32
  - [-1, 2, C3k2, [1024, True]]                  # 27
  - [-1, 1, SPPF, [1024, 5]]                     # 28

  - [25, 1, Conv, [1024, 3, 2]]                  # 29-P5/32
  - [-1, 2, C3k2, [1024, True]]                  # 30
  - [-1, 1, SPPF, [1024, 5]]                     # 31

  - [[28, 31], 1, GPT, [512]]                    # 32
  - [[28, 32], 1, Add_GPT, [1024, 0]]            # 33-P5/32 stream one:x + trans[0]
  - [[31, 32], 1, Add_GPT, [1024, 1]]            # 34-P5/32 stream two:x + trans[1]

  # Add Block 
  - [[17, 18], 1, Conadd, [1]]                   # 35-P3/8  fusion backbone P3
  - [[24, 25], 1, Conadd, [1]]                   # 36-P4/16 fusion backbone P4
  - [[33, 34], 1, Conadd, [1]]                   # 37-P5/32 fusion backbone P5
  - [-1, 2, C2PSA, [1024]]                       # 38


# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 39
  - [[-1, 36], 1, Concat, [1]]                   # 40 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 41

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 42
  - [[-1, 35], 1, Concat, [1]]                   # 43 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                  # 44 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 45
  - [[-1, 41], 1, Concat, [1]]                   # 46 cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 47 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 48
  - [[-1, 38], 1, Concat, [1]]                   # 49 cat head P5
  - [-1, 2, C3k2, [1024, True]]                  # 50 (P5/32-large)

  - [[44, 47, 50], 1, OBB, [nc, 1]]              # Detect (P3, P4, P5)
